using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class MonsterDatatxt : MonoBehaviour {
    public string[] introtxt2 = { "介紹:比起鑽木取火,帶一隻在身上顯然更方便", "介紹:吃飽睡,睡飽吃", "介紹:可愛的生物,偶爾會有百變怪變成的冒牌貨請注意", "介紹:傳聞中只要盯著他的肚子十分鐘就會進入催眠", "介紹:火箭隊的好朋友,最後的退場方式都是和火箭隊一起飛上天空", "介紹:傳聞中只要被咬住尾巴就會進化,但放心,因為他沒有尾巴", "介紹:火箭隊的好朋友二號,幫他加了手和腳之後更像一個人類了,就是這樣喵", "介紹:有了他就不需要隨身充電器了,但請先準備好變壓器", "介紹:看看你身邊的朋友是否有眼睛特別小的人,小心,他可能就是百變君變成的", "介紹:要借錢的時候找他就對了" };
    public string[] abilitxt2 = { "攻擊:4\n攻擊距離:3\n攻擊間格:5\n生命:100\n特殊技能:無", "攻擊:25\n攻擊距離:3\n攻擊間格:5\n生命:90\n特殊技能:無", "攻擊:7\n攻擊距離:2\n攻擊間格:2\n生命:100\n特殊技能:無", "攻擊:35\n攻擊距離:30\n攻擊間格:10\n生命:100\n特殊技能:水砲\n說明:會發射一個水砲攻擊", "攻擊:0\n攻擊距離:1\n攻擊間格:1\n生命:90\n特殊技能:反彈\n說明:會反彈受到傷害", "攻擊:15\n攻擊距離:50\n攻擊間格:5\n生命:50\n特殊技能:狙擊\n說明:攻擊最遠的敵人", "攻擊:10\n攻擊距離:3\n攻擊間格:5\n生命:100\n特殊技能:狂化\n說明:隨時間增強攻擊力", "攻擊:30\n攻擊距離:10\n攻擊間格:8\n生命:100\n特殊技能:閃電\n說明:會發射一個雷電攻擊", "攻擊:10\n攻擊距離:3\n攻擊間格:5\n生命:100\n特殊技能:變形\n說明:會變成攻擊目標的樣子", "攻擊:20\n攻擊距離:2\n攻擊間格:2\n生命:40\n特殊技能:治癒\n說明:會幫友軍回血" };
    public string[] nametxt2 = { "姓名:小火君", "姓名:卡比君", "姓名:伊君", "姓名:蝌蚪君", "姓名:果然君", "姓名:呆君", "姓名:喵君", "姓名:皮卡君", "姓名:百變君", "姓名:傑尼君" };
    public int[] cost2 = { 10, 20, 20, 30, 30, 30, 35, 35, 35, 35 };
    public string[] test = { "中文中文中文中文中文，中文中文中文中文中文中文中文中文中文中文中文中文中文", "test2", "test2", "test2", "test2", "test2", "test2", "test2", "test2", "test2" };
    // Use this for initialization
    void Start () {
      
    }
	
	// Update is called once per frame
	void Update () {
		
	}

    public int Returncost(string str)
    {
        int value = int.Parse(str)-1; //因為圖片編號是從1-10
        return cost2[value];
       
    }
}
